In [ ]:
# Q1.Write an SQL query to print the FIRST_NAME from worker table after removing white spaces from 
#  from the right side.
 Select RTRIM(FIRST_NAME) from Worker;

In [ ]:
# Q2.Write an SQL query to find the position of the alphabet ('a') in the first name column'Amitabh' 
#    from worker table.
Select INSTR(FIRST_NAME, BINARY'a') from Worker where FIRST_NAME ='Amitabh';

In [ ]:
# Q3.Write an SQL query to print the first three characters of FIRST_NAME from worker table.
Select substring(FIRST_NAME,1,3) from Worker;

In [ ]:
# Q4.write an SQL query to fetch unique values of DEPARTMENT from Worker table.
Select distinct DEPARTMENT from Worker;

In [ ]:
# Q5.Write an SQL query to fetch "FIRST_NAME" from Worker table in upper case.
Select upper(FIRST_NAME) from Worker;

In [ ]:
# Q6.Write an SQL query to fetch "FIRST_NAME" from Worker table using the alias name as <WORKER_NAME>.
Select FIRST_NAME AS WORKER_NAME from Worker;

In [ ]:
# Q7.Insert values in bonus table like the below:
#   Column name:(WORKER_REF_ID, BOUNUS_AMOUNT, BONUS_DATE) VALUES
#   Values: (001, 5000, '16-02-20'),
#           (002, 3000, '16-06-11'),
#           (003, 4000, '16-02-20'),
#           (001, 4500, '16-02-20'),
#           (002, 3500, '16-06-11')
CREATE TABLE `Bonus` (
        `WORKER_REF_ID` INT NOT NULL,
        `BONUS_AMOUNT` INT(10) NOT NULL,
        `BONUS_DATE` DATETIME NOT NULL,
        FOREIGN KEY (WORKER_REF_ID),
        REFERENCES Worker(WORKER_ID),
        ON DELETE CASCADE
);
 
 
INSERT INTO Bonus
(WORKER_REF_ID, BONUS_AMOUNT,BONUS_DATE)VALUES
(001,5000,'16-02-20'),
(002,3000,'16-06-11'),
(003,4000,'16-02-20'),
(001,4500,'16-02-20'),
(002,3500,'16-06-11');

In [ ]:
# Q8.Create a foreign key connection of bonus table with worker table:

A foreign key is a column or set of columns in a table that are used to establish a link between
data in two tables. In this case, you would want to create a foreign key connection between the 
"bonus" table and the "worker" table, using the "WORKER_REF_ID" column in the "bonus" table as the
foreign key.

Here is an example of an SQL query you could use to create a foreign key connection between the
"bonus" table and the "worker" table:

ALTER TABLE bonus
ADD FOREIGN KEY (WORKER_REF_ID)
REFERENCES worker(WORKER_REF_ID);


This query adds a foreign key constraint to the "bonus" table, using the "WORKER_REF_ID" column in
the "bonus" table as the foreign key and referencing the "WORKER_REF_ID" column in the "worker" table
as the primary key.

It's important to note that the exact syntax may vary depending on the specific database management
system you are using. Also, you will need the appropriate permissions and access to the database in
order to execute this query, and you should also be familiar with the database management system you 
are using.

Foreign Key constraints also provide referential integrity, these constraints make sure that the data
in the foreign key table is consistent with the data in the primary key table, it ensures that the
data in the foreign key table cannot be deleted or updated if it's referenced by data in the primary
key table.

In [ ]:
# Q9.Insert data in each column of the worker table:
#    Where column name are WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
#    And the values:
#    (001,'Monika','Arora',100000,'14-02-20 09.00.00','HR'),
#         (002,'Niharika','Verma',80000,'14-06-11 09.00.00','Admin'),
INSERT INTO worker table(WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT) 
VALUES 
    (001,'Monika','Arora',100000,'14-02-20 09.00.00','HR'),
    (002,'Niharika','Verma',80000,'14-06-11 09.00.00','Admin');

In [ ]:
# Q10.Create a sample table Worker with column name id, first name,last name,salary,joining date,
#      department.
CREATE TABLE Worker (Id,First_Name,Last_Name,Salary,Joining_Date,Department);

In [ ]:
# Q11.Create a sample table Worker with column name worker_id and worker_id will be not null and make
#      it primary key with auto-increment functionality.
CREATE TABLE Worker (Worker_Id INT NOT NULL PRIMARY KEY AUTO_INCREMENT);

In [ ]:
# Q12.Create a sample table test_table with column name first name and last name with CHAR(25),
#      column type

CREATE TEST_TABLE(FIRST_NAME CHAR(25), LAST_NAME CHAR(25));

In [ ]:
# Q13.Write a query to use the database name ekeeda_students
USE ekeeda_students;

In [ ]:
# Q14.Create a database in SQL:
CREATE DATABASE mydatabase;

In [ ]:
# Q15.Write a query to show the available databases
SELECT schema_name
FROM information_schema.schemata;